{
  "functional": [
    {
      "title": "User Authentication",
      "description": "The system shall allow new users to create accounts by providing a valid email address and password. The system shall ensure that the email address is unique and that the passwords match. The system shall save the credentials to the database."
    },
    {
      "title": "Gesture Recognition",
      "description": "The system shall recognize hand gestures within the camera scope and reflect the corresponding actions on the projected interface. The system shall be able to recognize default gestures for clicking, volume control, and cursor movement."
    },
    {
      "title": "Face Recognition",
      "description": "The system shall recognize users' faces and switch between their customized hand gestures. The system shall only respond to the registered user whose face is recognized."
    },
    {
      "title": "Customize Gesture Actions",
      "description": "The system shall allow users to customize the actions for specific gestures through a drop-down menu. The system shall save the customized gestures and use them for later interaction."
    },
    {
      "title": "Sign up",
      "description": "The user shall be able to sign up for an account by providing a valid email address and password. The system shall ensure that the email address is unique and that the passwords match. The system shall save the credentials to the database."
    },
    {
      "title": "Gesture Commands",
      "description": "The user shall be able to give commands to the system using hand gestures. The system shall recognize the gestures and reflect the corresponding actions on the projected interface."
    },
    {
      "title": "Face Detection",
      "description": "The system shall detect users' faces and switch between their customized hand gestures. The system shall only respond to the registered user whose face is recognized."
    },
    {
      "title": "Customize Gesture Actions",
      "description": "The user shall be able to customize the actions for specific gestures through a drop-down menu. The system shall save the customized gestures and use them for later interaction."
    }
  ],
  "non_functional": [
    {
      "title": "Low Latency",
      "description": "The system shall analyze gestures/clicks and reflect the corresponding actions on the projected interface with very low latency."
    },
    {
      "title": "Reliability",
      "description": "The system shall minimize false clicks, false face detection, and false hand gesture errors during use."
    },
    {
      "title": "Usability",
      "description": "The system shall provide an easy-to-use simple interface for end users."
    },
    {
      "title": "Compatibility with Hardware",
      "description": "The software is compatible with common and most projectors and cameras."
    },
    {
      "title": "Performance",
      "description": "The system shall analyze gestures/clicks and reflect the corresponding actions on the projected interface with very low latency, in addition to analyzing faces."
    }
  ]
}